# CompoundStructureLayer Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CompoundStructureLayer Constructor
CompoundStructureLayer Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CompoundStructureLayer()()()() | Creates a compound structure layer using default settings. |
| CompoundStructureLayer(CompoundStructureLayer) | Creates a copy of a compound structure layer. |
| CompoundStructureLayer(Double, MaterialFunctionAssignment, ElementId) | Creates a default compound structure layer based on the given width, function and material element id. |

# See Also
CompoundStructureLayer Class
CompoundStructureLayer Members
Autodesk.Revit.DB Namespace